// 引入
import 繁中 from "./繁體中文.mjs";

/* 下方皆使用中文與符號撰寫 */
/* 本函式庫在語法上預留了很多空間，包含但不限於下列用法 */

// 使用嚴格模式
繁中.使用嚴格模式;

// 判斷
繁中.控制台.記錄('判斷 - 如果');
繁中.如果(繁中.真, () => {繁中.控制台.記錄(繁中.一);});
繁中.如果(繁中.假)(() => {繁中.控制台.記錄(繁中.二);});

// 迴圈
繁中.控制台.記錄('迴圈 - 對於');
繁中.對於.的(繁中.新(繁中.陣列)(繁中.五)[繁中.翻譯.填充](繁中.零)[繁中.翻譯.地圖]((值, 索引) => 索引), 項 => {
    繁中.控制台.記錄(項);
});

繁中.控制台.記錄('迴圈 - 當');
繁中.宣告變數('當 - 甲', 繁中.零, 繁中.同區塊);
繁中.宣告變數('當 - 陣列', 繁中.陣列(), 繁中.同區塊);
繁中.當(繁中.讀取變數('當 - 甲'), () => 繁中.讀取變數('當 - 甲') < 繁中.十, () => {
    繁中.讀取變數('當 - 陣列')[繁中.讀取變數('當 - 甲')] = 繁中.讀取變數('當 - 甲') + 繁中.十;
    繁中.設定變數('當 - 甲', 繁中.讀取變數('當 - 甲')+繁中.一);
});
繁中.控制台.以表格整理(繁中.讀取變數('當 - 陣列'));